Revit 2027 API
AnalyticalPanel.GetAnalyticalOpeningsIds Method
 Returns the Analytical Openings ids of the Analytical Panel.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetAnalyticalOpeningsIds()
Public Function GetAnalyticalOpeningsIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetAnalyticalOpeningsIds()
member GetAnalyticalOpeningsIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Set of ElementId.
See Also
Reference
AnalyticalPanel Class
Autodesk.Revit.DB.Structure Namespace